
{
  "1": "You come across as independent, pioneering, and self-assured. Others see you as a natural leader with a strong personality and original ideas. You may appear to be focused on personal achievement and innovation.",
  "2": "You're perceived as cooperative, diplomatic, and sensitive. Others see you as someone who values harmony and teamwork. You appear to be a good listener and mediator in conflict situations.",
  "3": "You come across as expressive, creative, and sociable. Others see you as outgoing and optimistic. You may appear to be charming, witty, and articulate in your communications.",
  "4": "You're perceived as practical, reliable, and methodical. Others see you as someone who is organized and disciplined. You appear to be trustworthy and committed to your responsibilities.",
  "5": "You come across as adaptable, freedom-loving, and progressive. Others see you as versatile and adventurous. You may appear to be someone who embraces change and new experiences.",
  "6": "You're perceived as responsible, caring, and harmonious. Others see you as nurturing and reliable. You appear to be someone who values family, community, and service to others.",
  "7": "You come across as analytical, reserved, and thoughtful. Others see you as intelligent and introspective. You may appear to be someone who values knowledge, spirituality, and inner wisdom.",
  "8": "You're perceived as ambitious, powerful, and business-minded. Others see you as authoritative and confident. You appear to be someone who values material achievement and organizational skills.",
  "9": "You come across as compassionate, idealistic, and selfless. Others see you as humanitarian and generous. You may appear to be someone who values universal love and artistic expression.",
  "11": "You're perceived as inspirational, intuitive, and visionary. Others see you as highly sensitive and idealistic. You appear to be someone who has spiritual insights and innovative ideas.",
  "22": "You come across as practical, powerful, and highly capable. Others see you as someone who can turn dreams into reality. You may appear to be someone with exceptional organizational abilities and vision.",
  "33": "You're perceived as nurturing, compassionate, and selfless at a high level. Others see you as a natural teacher or healer. You appear to be someone who embodies unconditional love and service to humanity."
}
