
{
  "1": "Your generation is characterized by innovation, independence, and leadership. You're part of a pioneering group that values individuality and new beginnings. Your generation tends to be self-reliant and focused on creating original pathways.",
  "2": "Your generation is characterized by cooperation, diplomacy, and sensitivity. You're part of a group that values partnerships and working together. Your generation tends to be mediators and peacemakers in society.",
  "3": "Your generation is characterized by creativity, self-expression, and communication. You're part of a group that values artistic endeavors and social connections. Your generation tends to be optimistic and brings joy to the world.",
  "4": "Your generation is characterized by practicality, stability, and hard work. You're part of a group that values tradition and structure. Your generation tends to be reliable builders of social institutions.",
  "5": "Your generation is characterized by freedom, change, and adaptability. You're part of a group that values progress and new experiences. Your generation tends to challenge conventions and embrace diversity.",
  "6": "Your generation is characterized by responsibility, harmony, and service. You're part of a group that values family and community. Your generation tends to focus on nurturing and healing social wounds.",
  "7": "Your generation is characterized by analysis, wisdom, and spiritual seeking. You're part of a group that values knowledge and inner truth. Your generation tends to question deeply and seek meaning beyond material reality.",
  "8": "Your generation is characterized by ambition, efficiency, and material achievement. You're part of a group that values organization and business. Your generation tends to focus on creating wealth and infrastructure.",
  "9": "Your generation is characterized by compassion, universality, and humanitarianism. You're part of a group that values global consciousness. Your generation tends to focus on healing the planet and serving humanity at large.",
  "11": "Your generation is characterized by high idealism, intuition, and spiritual awareness. You're part of a group that values inspiration and vision. Your generation tends to bring illumination to humanity's path.",
  "22": "Your generation is characterized by practical mastery and large-scale achievements. You're part of a group that values building lasting structures. Your generation tends to transform dreams into reality on a magnificent scale.",
  "33": "Your generation is characterized by selfless service, healing, and compassionate teaching. You're part of a group that values unconditional love. Your generation tends to elevate humanity's consciousness through nurturing and wisdom."
}
