
{
  "1": "Your primary life lesson is to develop independence and self-confidence while also learning when to collaborate with others. Finding balance between autonomy and teamwork is key to your growth.",
  "2": "Your lessons revolve around developing patience and diplomacy. You need to learn to stand up for yourself while still maintaining harmony and peace in your relationships.",
  "3": "You must learn to focus your creative energies and follow through on projects. Learning to express yourself authentically without seeking constant validation is essential for your development.",
  "4": "Your challenge is to find freedom within structure and to develop flexibility. Learning that stability doesn't equal limitation will help you grow beyond perceived restrictions.",
  "5": "You need to learn to use your freedom constructively and develop commitment. Finding stability amidst change and avoiding excess are important life lessons.",
  "6": "Your lesson is to learn boundaries in your caretaking tendencies and to balance giving to others with self-care. Learning when not to fix everyone's problems is crucial.",
  "7": "You must learn to balance intellect with emotion and spirituality with practicality. Sharing your wisdom rather than isolating yourself is an important part of your journey.",
  "8": "Learning to use power ethically and to balance material and spiritual wealth are your key lessons. Understanding that true success includes more than financial achievement.",
  "9": "Your challenge is to learn to let go and complete cycles in your life. Learning to balance giving to causes with taking care of your personal needs is essential.",
  "11": "You must learn to ground your spiritual insights into practical application. Managing sensitivity while maintaining boundaries is a lifelong lesson.",
  "22": "Your challenge is to realize your grand visions despite self-doubt. Learning to harness your power for the greater good without being overwhelmed by responsibility.",
  "33": "You need to learn to balance your selfless service with personal needs. Finding ways to uplift humanity while maintaining your own well-being is your ongoing challenge."
}
