
{
  "1": "This is a year of new beginnings, independence, and initiative. It's time to start fresh, set new goals, and take bold action. Focus on developing your individuality and leadership skills. You're planting seeds for the next nine-year cycle.",
  "2": "This is a year for patience, partnerships, and diplomacy. Focus on cooperation, relationships, and careful attention to detail. Your sensitivity and intuition are heightened. Progress comes through collaboration rather than direct action.",
  "3": "This is a year of creativity, self-expression, and social connection. It's favorable for communication, artistic endeavors, and expanding your social circle. Express your ideas, enjoy yourself, and approach life with optimism and joy.",
  "4": "This is a year of building foundations, hard work, and organization. Focus on creating stability, establishing systems, and attending to practical matters. Discipline and methodical effort will bring long-term rewards.",
  "5": "This is a year of change, freedom, and adventure. Expect the unexpected and be flexible. It's favorable for travel, new experiences, and breaking out of routines. Embrace change and take calculated risks for growth.",
  "6": "This is a year of responsibility, service, and harmony. Focus on family, home, and community. You may take on caretaking roles or make improvements to your home environment. Creating balance in all areas of life is essential.",
  "7": "This is a year for introspection, analysis, and spiritual growth. Take time for research, planning, and inner work. You may feel drawn to solitude or specialized study. Trust your intuition and seek deeper understanding.",
  "8": "This is a year of achievement, power, and material rewards. Focus on business, finances, and demonstrating leadership. Your efforts in previous years can come to fruition with tangible results. Think practically and aim high.",
  "9": "This is a year of completion, release, and transformation. It's time to let go of what no longer serves you before beginning a new cycle. Focus on humanitarian concerns, forgiveness, and seeing the big picture.",
  "11": "This is a year of heightened intuition, inspiration, and spiritual awareness. You may experience illumination and insights beyond ordinary understanding. Your sensitivity is at its peak, and you can access higher wisdom.",
  "22": "This is a year of powerful manifestation and practical mastery. You can accomplish great things by combining vision with disciplined action. Think on a large scale about how your efforts can benefit many people.",
  "33": "This is a year of master teaching, healing, and compassionate service. Your focus is on how you can nurture, guide, and heal others. Your influence can be far-reaching with a humanitarian approach."
}
