
{
  "1": "Te presentas como independiente, pionero y seguro de ti mismo. Los demás te ven como un líder natural con una personalidad fuerte e ideas originales. Puedes parecer enfocado en el logro personal y la innovación.",
  "2": "Te perciben como cooperativo, diplomático y sensible. Los demás te ven como alguien que valora la armonía y el trabajo en equipo. Pareces ser un buen oyente y mediador en situaciones de conflicto.",
  "3": "Te presentas como expresivo, creativo y sociable. Los demás te ven como extrovertido y optimista. Puedes parecer encantador, ingenioso y articulado en tus comunicaciones.",
  "4": "Te perciben como práctico, confiable y metódico. Los demás te ven como alguien organizado y disciplinado. Pareces ser digno de confianza y comprometido con tus responsabilidades.",
  "5": "Te presentas como adaptable, amante de la libertad y progresista. Los demás te ven como versátil y aventurero. Puedes parecer alguien que abraza el cambio y las nuevas experiencias.",
  "6": "Te perciben como responsable, cariñoso y armonioso. Los demás te ven como alguien que nutre y es confiable. Pareces ser alguien que valora la familia, la comunidad y el servicio a los demás.",
  "7": "Te presentas como analítico, reservado y reflexivo. Los demás te ven como inteligente e introspectivo. Puedes parecer alguien que valora el conocimiento, la espiritualidad y la sabiduría interior.",
  "8": "Te perciben como ambicioso, poderoso y orientado a los negocios. Los demás te ven como autoritario y seguro. Pareces ser alguien que valora el logro material y las habilidades organizativas.",
  "9": "Te presentas como compasivo, idealista y desinteresado. Los demás te ven como humanitario y generoso. Puedes parecer alguien que valora el amor universal y la expresión artística.",
  "11": "Te perciben como inspirador, intuitivo y visionario. Los demás te ven como altamente sensible e idealista. Pareces ser alguien que tiene ideas espirituales e innovadoras.",
  "22": "Te presentas como práctico, poderoso y altamente capaz. Los demás te ven como alguien que puede convertir los sueños en realidad. Puedes parecer alguien con habilidades organizativas y visión excepcionales.",
  "33": "Te perciben como alguien que nutre, compasivo y desinteresado a un alto nivel. Los demás te ven como un maestro o sanador natural. Pareces ser alguien que encarna el amor incondicional y el servicio a la humanidad."
}
