
{
  "1": "Tu generación se caracteriza por la innovación, la independencia y el liderazgo. Formas parte de un grupo pionero que valora la individualidad y los nuevos comienzos. Tu generación tiende a ser autosuficiente y se centra en crear caminos originales.",
  "2": "Tu generación se caracteriza por la cooperación, la diplomacia y la sensibilidad. Formas parte de un grupo que valora las asociaciones y el trabajo conjunto. Tu generación tiende a ser mediadora y pacificadora en la sociedad.",
  "3": "Tu generación se caracteriza por la creatividad, la autoexpresión y la comunicación. Formas parte de un grupo que valora los esfuerzos artísticos y las conexiones sociales. Tu generación tiende a ser optimista y trae alegría al mundo.",
  "4": "Tu generación se caracteriza por la practicidad, la estabilidad y el trabajo duro. Formas parte de un grupo que valora la tradición y la estructura. Tu generación tiende a ser constructores confiables de instituciones sociales.",
  "5": "Tu generación se caracteriza por la libertad, el cambio y la adaptabilidad. Formas parte de un grupo que valora el progreso y las nuevas experiencias. Tu generación tiende a desafiar las convenciones y abrazar la diversidad.",
  "6": "Tu generación se caracteriza por la responsabilidad, la armonía y el servicio. Formas parte de un grupo que valora la familia y la comunidad. Tu generación tiende a centrarse en nutrir y sanar las heridas sociales.",
  "7": "Tu generación se caracteriza por el análisis, la sabiduría y la búsqueda espiritual. Formas parte de un grupo que valora el conocimiento y la verdad interior. Tu generación tiende a cuestionar profundamente y buscar significado más allá de la realidad material.",
  "8": "Tu generación se caracteriza por la ambición, la eficiencia y el logro material. Formas parte de un grupo que valora la organización y los negocios. Tu generación tiende a centrarse en crear riqueza e infraestructura.",
  "9": "Tu generación se caracteriza por la compasión, la universalidad y el humanitarismo. Formas parte de un grupo que valora la conciencia global. Tu generación tiende a centrarse en sanar el planeta y servir a la humanidad en general.",
  "11": "Tu generación se caracteriza por un alto idealismo, intuición y conciencia espiritual. Formas parte de un grupo que valora la inspiración y la visión. Tu generación tiende a traer iluminación al camino de la humanidad.",
  "22": "Tu generación se caracteriza por el dominio práctico y los logros a gran escala. Formas parte de un grupo que valora la construcción de estructuras duraderas. Tu generación tiende a transformar los sueños en realidad a una escala magnífica.",
  "33": "Tu generación se caracteriza por el servicio desinteresado, la sanación y la enseñanza compasiva. Formas parte de un grupo que valora el amor incondicional. Tu generación tiende a elevar la conciencia de la humanidad a través de la nutrición y la sabiduría."
}
