
{
  "1": {
    "title": "El Líder",
    "meaning": "Las personas con Camino de Vida 1 son líderes naturales. Son independientes, determinados y ambiciosos. Tienen una fuerte voluntad y son muy autosuficientes. Son innovadores y no tienen miedo de ser pioneros en nuevas formas de hacer las cosas."
  },
  "2": {
    "title": "El Mediador",
    "meaning": "Las personas con Camino de Vida 2 son pacíficas y diplomáticas. Son cooperativas, consideradas y sensibles a las necesidades de los demás. Sobresalen en las asociaciones y funcionan mejor en entornos armoniosos. Son grandes mediadores que pueden unir a partes opuestas."
  },
  "3": {
    "title": "El Creador",
    "meaning": "Aquellos con Camino de Vida 3 son creativos, expresivos y sociables. Tienen un talento artístico natural y un don para la comunicación. Aportan alegría y optimismo a los demás y suelen ser el alma de la fiesta. Son imaginativos y tienen una profunda apreciación por la belleza."
  },
  "4": {
    "title": "El Constructor",
    "meaning": "Las personas con Camino de Vida 4 son prácticas, confiables y trabajadoras. Son metódicas, sistemáticas y grandes solucionadoras de problemas. Valoran la estabilidad y la seguridad y se dedican a crear una base sólida para ellos mismos y para los demás. Son disciplinados y dignos de confianza."
  },
  "5": {
    "title": "El Buscador de Libertad",
    "meaning": "Aquellos con Camino de Vida 5 son aventureros, versátiles y amantes de la libertad. Adoptan el cambio y se adaptan a nuevas situaciones. Tienen una curiosidad natural y un deseo de explorar el mundo que les rodea. Son enérgicos, dinámicos y resisten a la rutina."
  },
  "6": {
    "title": "El Cuidador",
    "meaning": "Las personas con Camino de Vida 6 son compasivas, nutrientes y responsables. Tienen un fuerte sentido del deber hacia la familia y la comunidad. Son consejeros naturales a quienes les gusta cuidar de los demás. Valoran la armonía, el equilibrio y la belleza en su entorno."
  },
  "7": {
    "title": "El Buscador",
    "meaning": "Aquellos con Camino de Vida 7 son analíticos, intuitivos y espiritualmente orientados. Tienen una profunda necesidad de comprender las verdades subyacentes de la vida. Son investigadores naturales que buscan conocimiento y sabiduría. Valoran su privacidad y tiempo para la introspección."
  },
  "8": {
    "title": "El Triunfador",
    "meaning": "Las personas con Camino de Vida 8 son ambiciosas, prácticas y orientadas a objetivos. Tienen una habilidad natural para los negocios y asuntos financieros. Están determinadas a lograr el éxito material y el reconocimiento. Son autoritarias, seguras y tienen buen juicio."
  },
  "9": {
    "title": "El Humanitario",
    "meaning": "Aquellos con Camino de Vida 9 son compasivos, desinteresados e idealistas. Tienen un fuerte sentido de la justicia y el deseo de hacer del mundo un lugar mejor. Se sienten naturalmente atraídos por causas humanitarias y por ayudar a los demás. Son tolerantes, generosos y perdonadores."
  },
  "11": {
    "title": "El Intuitivo",
    "meaning": "El Camino de Vida 11 es un Número Maestro que representa una alta conciencia espiritual y habilidades intuitivas. Estas personas son idealistas, inspiradoras y visionarias. Son sanadores naturales que pueden tender un puente entre los mundos material y espiritual."
  },
  "22": {
    "title": "El Maestro Constructor",
    "meaning": "El Camino de Vida 22 es conocido como el 'Maestro Constructor'. Estas personas tienen el potencial de lograr grandes cosas a gran escala. Son visionarios prácticos que pueden manifestar sus ideas en la realidad. Son altamente ambiciosos y disciplinados."
  },
  "33": {
    "title": "El Maestro Profesor",
    "meaning": "El Camino de Vida 33 es el 'Maestro Profesor'. Estas personas tienen una alta conciencia espiritual y una profunda compasión por la humanidad. Son nutrientes desinteresados que inspiran y elevan a otros a través de su sabiduría y amor. Están destinados a crear un cambio positivo significativo."
  }
}
