
{
  "1": "Tu principal lección de vida es desarrollar independencia y confianza en ti mismo, al mismo tiempo que aprendes cuándo colaborar con otros. Encontrar el equilibrio entre la autonomía y el trabajo en equipo es clave para tu crecimiento.",
  "2": "Tus lecciones giran en torno a desarrollar paciencia y diplomacia. Necesitas aprender a defenderte mientras mantienes la armonía y la paz en tus relaciones.",
  "3": "Debes aprender a enfocar tus energías creativas y completar los proyectos. Aprender a expresarte auténticamente sin buscar validación constante es esencial para tu desarrollo.",
  "4": "Tu desafío es encontrar la libertad dentro de la estructura y desarrollar flexibilidad. Aprender que la estabilidad no equivale a limitación te ayudará a crecer más allá de las restricciones percibidas.",
  "5": "Necesitas aprender a usar tu libertad de manera constructiva y desarrollar compromiso. Encontrar estabilidad en medio del cambio y evitar el exceso son lecciones de vida importantes.",
  "6": "Tu lección es aprender límites en tus tendencias de cuidado y equilibrar el dar a los demás con el autocuidado. Aprender cuándo no solucionar los problemas de todos es crucial.",
  "7": "Debes aprender a equilibrar el intelecto con la emoción y la espiritualidad con la practicidad. Compartir tu sabiduría en lugar de aislarte es una parte importante de tu viaje.",
  "8": "Aprender a usar el poder éticamente y equilibrar la riqueza material y espiritual son tus lecciones clave. Entender que el verdadero éxito incluye más que el logro financiero.",
  "9": "Tu desafío es aprender a soltar y completar ciclos en tu vida. Aprender a equilibrar el dar a causas con cuidar de tus necesidades personales es esencial.",
  "11": "Debes aprender a poner en práctica tus conocimientos espirituales. Manejar la sensibilidad mientras mantienes los límites es una lección para toda la vida.",
  "22": "Tu desafío es realizar tus grandes visiones a pesar de la duda de ti mismo. Aprender a aprovechar tu poder para el bien común sin sentirte abrumado por la responsabilidad.",
  "33": "Necesitas aprender a equilibrar tu servicio desinteresado con las necesidades personales. Encontrar formas de elevar a la humanidad mientras mantienes tu propio bienestar es tu desafío continuo."
}
