{
  "1": {
    "bestMatches": [1, 3, 5],
    "goodMatches": [7, 9],
    "challengingMatches": [2, 4, 6, 8],
    "compatibility": {
      "overview": "En el Día Personal 1, tienes energía para nuevos comienzos y liderazgo. Es un excelente día para iniciar proyectos y tomar la iniciativa.",
      "bestMatchesDesc": "Los días 1, 3 y 5 amplifican tu energía de liderazgo con creatividad y libertad.",
      "goodMatchesDesc": "Los días 7 y 9 proporcionan planificación reflexiva y perspectiva humanitaria a tus iniciativas.",
      "challengingMatchesDesc": "Los días 2, 4, 6 y 8 pueden sentirse demasiado lentos o restrictivos para tu energía pionera."
    }
  },
  "2": {
    "bestMatches": [2, 4, 6, 8],
    "goodMatches": [7, 9],
    "challengingMatches": [1, 3, 5],
    "compatibility": {
      "overview": "El Día Personal 2 trae cooperación, sensibilidad y enfoque en asociaciones. Es ideal para colaboración y construcción de relaciones.",
      "bestMatchesDesc": "Los días 2, 4, 6 y 8 apoyan tu naturaleza cooperativa con estabilidad y estructura.",
      "goodMatchesDesc": "Los días 7 y 9 añaden sabiduría y compasión a tu enfoque diplomático.",
      "challengingMatchesDesc": "Los días 1, 3 y 5 pueden sentirse demasiado agresivos o dispersos para tu energía gentil y colaborativa."
    }
  },
  "3": {
    "bestMatches": [1, 3, 5],
    "goodMatches": [6, 9],
    "challengingMatches": [2, 4, 7, 8],
    "compatibility": {
      "overview": "El Día Personal 3 despierta creatividad, comunicación y energía social. Perfecto para actividades artísticas y conexiones sociales.",
      "bestMatchesDesc": "Los días 1, 3 y 5 alimentan tu fuego creativo con liderazgo y aventura.",
      "goodMatchesDesc": "Los días 6 y 9 traen apoyo nutritivo y visión humanitaria a tu expresión creativa.",
      "challengingMatchesDesc": "Los días 2, 4, 7 y 8 pueden apagar tu espíritu creativo espontáneo con demasiada estructura."
    }
  },
  "4": {
    "bestMatches": [2, 4, 6, 8],
    "goodMatches": [1, 9],
    "challengingMatches": [3, 5, 7],
    "compatibility": {
      "overview": "El Día Personal 4 enfatiza el trabajo, organización y construcción de bases sólidas. Excelente para tareas prácticas y progreso sistemático.",
      "bestMatchesDesc": "Los días 2, 4, 6 y 8 apoyan tu enfoque metódico con cooperación y ambición.",
      "goodMatchesDesc": "Los días 1 y 9 añaden dirección de liderazgo y propósito humanitario a tu trabajo.",
      "challengingMatchesDesc": "Los días 3, 5 y 7 pueden sentirse demasiado impredecibles o teóricos para tu enfoque práctico."
    }
  },
  "5": {
    "bestMatches": [1, 3, 5],
    "goodMatches": [7, 9],
    "challengingMatches": [2, 4, 6, 8],
    "compatibility": {
      "overview": "El Día Personal 5 trae libertad, aventura y cambio. Excelente para viajar, aprender cosas nuevas y romper rutinas.",
      "bestMatchesDesc": "Los días 1, 3 y 5 coinciden con tu espíritu aventurero con liderazgo y creatividad.",
      "goodMatchesDesc": "Los días 7 y 9 añaden profundidad y significado a tus exploraciones.",
      "challengingMatchesDesc": "Los días 2, 4, 6 y 8 pueden sentirse demasiado restrictivos o enfocados en la rutina para tu necesidad de libertad."
    }
  },
  "6": {
    "bestMatches": [2, 4, 6, 8],
    "goodMatches": [3, 9],
    "challengingMatches": [1, 5, 7],
    "compatibility": {
      "overview": "El Día Personal 6 se enfoca en el hogar, familia y responsabilidades nutritivas. Perfecto para cuidar a otros y crear armonía.",
      "bestMatchesDesc": "Los días 2, 4, 6 y 8 apoyan tu naturaleza nutritiva con cooperación y estabilidad.",
      "goodMatchesDesc": "Los días 3 y 9 añaden alegría y servicio compasivo a tu enfoque cariñoso.",
      "challengingMatchesDesc": "Los días 1, 5 y 7 pueden sentirse demasiado independientes o desapegados para tu energía enfocada en la familia."
    }
  },
  "7": {
    "bestMatches": [5, 7, 9],
    "goodMatches": [2, 4],
    "challengingMatches": [1, 3, 6, 8],
    "compatibility": {
      "overview": "El Día Personal 7 fomenta la introspección, estudio y actividades espirituales. Ideal para investigación, meditación y pensamiento profundo.",
      "bestMatchesDesc": "Los días 5, 7 y 9 complementan tu naturaleza introspectiva con exploración y sabiduría.",
      "goodMatchesDesc": "Los días 2 y 4 proporcionan apoyo gentil y estructura para tu estado contemplativo.",
      "challengingMatchesDesc": "Los días 1, 3, 6 y 8 pueden sentirse demasiado demandantes o sociales para tu necesidad de solitud."
    }
  },
  "8": {
    "bestMatches": [2, 4, 6, 8],
    "goodMatches": [1],
    "challengingMatches": [3, 5, 7, 9],
    "compatibility": {
      "overview": "El Día Personal 8 se enfoca en el éxito material, negocios y logros. Excelente para reuniones importantes y decisiones financieras.",
      "bestMatchesDesc": "Los días 2, 4, 6 y 8 apoyan tus metas ambiciosas con cooperación y acción práctica.",
      "goodMatchesDesc": "El día 1 añade iniciativa de liderazgo a tu energía enfocada en negocios.",
      "challengingMatchesDesc": "Los días 3, 5, 7 y 9 pueden distraer de tu enfoque material con creatividad o idealismo."
    }
  },
  "9": {
    "bestMatches": [3, 6, 9],
    "goodMatches": [1, 2, 7],
    "challengingMatches": [4, 5, 8],
    "compatibility": {
      "overview": "El Día Personal 9 enfatiza la finalización, servicio humanitario y dar a otros. Perfecto para trabajo caritativo y ayudar a otros.",
      "bestMatchesDesc": "Los días 3, 6 y 9 amplifican tu naturaleza compasiva con creatividad y servicio nutritivo.",
      "goodMatchesDesc": "Los días 1, 2 y 7 añaden liderazgo, cooperación y sabiduría a tus esfuerzos humanitarios.",
      "challengingMatchesDesc": "Los días 4, 5 y 8 pueden sentirse demasiado prácticos o centrados en sí mismos para tu espíritu generoso."
    }
  },
  "11": {
    "bestMatches": [2, 7, 9, 11],
    "goodMatches": [3, 6, 22],
    "challengingMatches": [1, 4, 5, 8],
    "compatibility": {
      "overview": "El Día Personal 11 es un día de número maestro de percepción espiritual, intuición e inspiración. Este día amplifica tu conciencia psíquica y conexión con la guía superior.",
      "bestMatchesDesc": "Los días 2, 7, 9 y 11 resuenan con tu naturaleza intuitiva y espiritual, mejorando la sabiduría y compasión.",
      "goodMatchesDesc": "Los días 3, 6 y 22 añaden expresión creativa, energía nutritiva y visión de maestro constructor a tus percepciones.",
      "challengingMatchesDesc": "Los días 1, 4, 5 y 8 pueden sentirse demasiado prácticos o orientados a la acción para tu energía espiritual contemplativa."
    }
  },
  "22": {
    "bestMatches": [4, 6, 8, 22],
    "goodMatches": [2, 9, 11],
    "challengingMatches": [1, 3, 5, 7],
    "compatibility": {
      "overview": "El Día Personal 22 es un día de maestro constructor para manifestar sueños a gran escala en realidad. Este día combina visión espiritual con maestría práctica.",
      "bestMatchesDesc": "Los días 4, 6, 8 y 22 apoyan tu energía de maestro constructor con estructura, nutrición y logro ambicioso.",
      "goodMatchesDesc": "Los días 2, 9 y 11 añaden cooperación, propósito humanitario y percepción espiritual a tus esfuerzos de construcción.",
      "challengingMatchesDesc": "Los días 1, 3, 5 y 7 pueden sentirse demasiado independientes o dispersos para tu visión enfocada a gran escala."
    }
  },
  "33": {
    "bestMatches": [3, 6, 9, 33],
    "goodMatches": [2, 11, 22],
    "challengingMatches": [1, 4, 5, 7, 8],
    "compatibility": {
      "overview": "El Día Personal 33 es un día de maestro maestro de servicio compasivo y sanación espiritual. Este día amplifica tu capacidad de elevar e inspirar a otros.",
      "bestMatchesDesc": "Los días 3, 6, 9 y 33 resuenan con tu energía nutritiva, creativa y humanitaria de maestro maestro.",
      "goodMatchesDesc": "Los días 2, 11 y 22 añaden cooperación, percepción espiritual y poder de manifestación a tu trabajo de sanación.",
      "challengingMatchesDesc": "Los días 1, 4, 5, 7 y 8 pueden sentirse demasiado centrados en sí mismos o materiales para tu energía de servicio desinteresado."
    }
  }
}