
{
  "1": "Este es un año de nuevos comienzos, independencia e iniciativa. Es tiempo de empezar de nuevo, establecer nuevas metas y tomar acción audaz. Concéntrate en desarrollar tu individualidad y habilidades de liderazgo. Estás plantando semillas para el próximo ciclo de nueve años.",
  "2": "Este es un año para paciencia, asociaciones y diplomacia. Concéntrate en la cooperación, relaciones y atención cuidadosa al detalle. Tu sensibilidad e intuición están elevadas. El progreso viene a través de la colaboración más que la acción directa.",
  "3": "Este es un año de creatividad, autoexpresión y conexión social. Es favorable para la comunicación, esfuerzos artísticos y expandir tu círculo social. Expresa tus ideas, disfruta y aborda la vida con optimismo y alegría.",
  "4": "Este es un año de construir cimientos, trabajo duro y organización. Concéntrate en crear estabilidad, establecer sistemas y atender asuntos prácticos. La disciplina y el esfuerzo metódico traerán recompensas a largo plazo.",
  "5": "Este es un año de cambio, libertad y aventura. Espera lo inesperado y sé flexible. Es favorable para viajar, nuevas experiencias y romper rutinas. Abraza el cambio y toma riesgos calculados para crecer.",
  "6": "Este es un año de responsabilidad, servicio y armonía. Concéntrate en la familia, el hogar y la comunidad. Puedes asumir roles de cuidador o hacer mejoras a tu entorno hogareño. Crear equilibrio en todas las áreas de la vida es esencial.",
  "7": "Este es un año para introspección, análisis y crecimiento espiritual. Tómate tiempo para investigación, planificación y trabajo interior. Puedes sentirte atraído a la soledad o estudio especializado. Confía en tu intuición y busca un entendimiento más profundo.",
  "8": "Este es un año de logro, poder y recompensas materiales. Concéntrate en los negocios, las finanzas y demostrar liderazgo. Tus esfuerzos en años anteriores pueden dar frutos con resultados tangibles. Piensa prácticamente y apunta alto.",
  "9": "Este es un año de finalización, liberación y transformación. Es tiempo de dejar ir lo que ya no te sirve antes de comenzar un nuevo ciclo. Concéntrate en preocupaciones humanitarias, perdón y ver el panorama general.",
  "11": "Este es un año de intuición elevada, inspiración y conciencia espiritual. Puedes experimentar iluminación y percepciones más allá del entendimiento ordinario. Tu sensibilidad está en su punto máximo y puedes acceder a una sabiduría superior.",
  "22": "Este es un año de poderosa manifestación y maestría práctica. Puedes lograr grandes cosas combinando visión con acción disciplinada. Piensa a gran escala sobre cómo tus esfuerzos pueden beneficiar a muchas personas.",
  "33": "Este es un año de enseñanza magistral, sanación y servicio compasivo. Tu enfoque está en cómo puedes nutrir, guiar y sanar a otros. Tu influencia puede ser de largo alcance con un enfoque humanitario."
}
