
{
  "1": "Este mes trae nuevos comienzos y oportunidades para el liderazgo. Es tiempo de iniciar proyectos, afirmarte y demostrar independencia. Concéntrate en tus metas y toma acción.",
  "2": "Este mes enfatiza las relaciones y la cooperación. Es un tiempo para la diplomacia, paciencia y atención al detalle. Escucha tu intuición y trabaja armoniosamente con otros.",
  "3": "Este mes trae energía creativa y autoexpresión. Es favorable para la comunicación, esfuerzos artísticos y actividades sociales. Expresa tus ideas y disfruta.",
  "4": "Este mes se trata de construir cimientos y enfocarse en asuntos prácticos. Es tiempo para organización, disciplina y trabajo duro. Concéntrate en crear estabilidad y orden.",
  "5": "Este mes trae cambio, libertad y aventura. Espera lo inesperado y sé flexible. Es un gran momento para viajar, nuevas experiencias y romper rutinas.",
  "6": "Este mes enfatiza la responsabilidad y el servicio a otros. Concéntrate en la familia, el hogar y la comunidad. Es un tiempo para crear armonía, nutrir relaciones y encontrar equilibrio.",
  "7": "Este mes es para introspección, análisis y crecimiento espiritual. Tómate tiempo para investigación, planificación y trabajo interior. Confía en tu intuición y busca un entendimiento más profundo.",
  "8": "Este mes se enfoca en el logro, autoridad y preocupaciones materiales. Es favorable para negocios, planificación financiera y demostrar liderazgo. Piensa prácticamente y apunta alto.",
  "9": "Este mes trae finalización, liberación y preocupaciones humanitarias. Es tiempo de dejar ir lo que ya no te sirve y enfocarte en el bien mayor. Sé compasivo y perdonador.",
  "11": "Este mes conlleva intuición elevada y conciencia espiritual. Estar abierto a inspiración y percepciones. Tu sensibilidad está en su punto máximo, y puedes conectar con una sabiduría superior.",
  "22": "Este mes contiene poderosa energía de manifestación. Puedes lograr grandes cosas a través de la acción práctica. Piensa a gran escala sobre cómo tus esfuerzos pueden beneficiar a muchos.",
  "33": "Este mes trae energía de enseñanza magistral y sanación. Concéntrate en cómo puedes nutrir, guiar y sanar a otros con compasión. Tu servicio puede tener efectos de largo alcance."
}
